AccumulationRegisters/ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов</Name>
			<Comment>(Общ) Оперативное ведение расчетов с контрагентами по договорам с учетом расчетов по документам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета для договоров в у.е. </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетовСКонтрагентом</Name>
					<Comment>Незакрытый документ поставки/оплаты</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеРеализацииТоваровИУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеПоступленияТоваровИУслугНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчетовСКонтрагентом</Name>
					<Comment>Вид расчетов (по приобретению, по реализации, прочее)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетовСКонтрагентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УпрУчет</Name>
					<Comment>Отражается ли документ расчетов с контрагентами в управленческом учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийОплатаОтПокупателяПлатежнойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОплатаОтПокупателяПлатежнойКартой</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>(Общ) Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>(Общ) Расчетная ставка НДС 5% / 105%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>(Общ) Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>(Общ) Расчетная ставка НДС 7% / 107%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>(Общ) Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>(Общ) Расчетная ставка НДС 22% / 122%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПризнакиСпособаРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПризнакиСпособаРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
					<Comment>Аванс</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаКредита</Name>
					<Comment>Оплата предмета расчета после его передачи с оплатой в кредит (оплата кредита) </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаБезОплаты</Name>
					<Comment>Передача предмета расчета без его оплаты в момент его передачи с последующей оплатой в кредит</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСПолнойОплатой</Name>
					<Comment>Полная оплата, в том числе с учетом аванса (предварительной оплаты) в момент передачи предмета расчета</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСЧастичнойОплатой</Name>
					<Comment>Частичная оплата предмета расчета в момент его передачи с последующей оплатой в кредит </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаПолная</Name>
					<Comment>Полная предварительная оплата до момента передачи предмета расчета</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоплатаЧастичная</Name>
					<Comment>Частичная предварительная оплата до момента передачи предмета расчета</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Тинькофф/Ext/Module.bsl
Функция ПолучитьТаблицуРеализацийДляВозврата(ОплатаПлатежнойКартой) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК Реализация,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток * -1 КАК СуммаВозврата
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|			,
	|			ДоговорКонтрагента.РозничнаяПродажа
	|				И ДокументРасчетовСКонтрагентом В (&СписокДокументовРасчетов)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток < 0";
	
	СписокДокументовРасчетов = Новый СписокЗначений;
	
	Для каждого Строка Из ОплатаПлатежнойКартой.РасшифровкаПлатежа Цикл
		
		Если ТипЗнч(Строка.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СписокДокументовРасчетов.Добавить(Строка.ДокументРасчетовСКонтрагентом);	
		КонецЕсли; 
		
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("СписокДокументовРасчетов", СписокДокументовРасчетов);
	
	ТаблицаДляВозврата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДляВозврата;
	
КонецФункции

Функция СоздатьДокументВозврата(ОплатаПлатежнойКартой, СтрокаВозврата) Экспорт
	
	ДоговорЭквайринга = ОплатаПлатежнойКартой.ДоговорЭквайринга;
	Реализация = СтрокаВозврата.Реализация;
	Сумма = СтрокаВозврата.СуммаВозврата;
	
	НовыйДокумент = Документы.ОплатаОтПокупателяПлатежнойКартой.СоздатьДокумент();
	
	ЗаполнитьЗначенияСвойств(НовыйДокумент, ОплатаПлатежнойКартой, , "Номер, ИДПлатежа, RRNКодОперации, НомерЧекаККМ, ШтампВерсии");
	
	НовыйДокумент.Дата = ТекущаяДата();
	НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю;
	НовыйДокумент.СуммаДокумента = Сумма; 
	
	НовыйДокумент.КурсДокумента = 1;
	НовыйДокумент.КратностьДокумента = 1;
	
	Если НЕ ДоговорЭквайринга.ТарифыЗаРасчетноеОбслуживание.Количество() = 0 Тогда
		
		НовыйДокумент.ВидОплаты = ДоговорЭквайринга.ТарифыЗаРасчетноеОбслуживание[0].ВидОплаты;			
		ПроцентТорговойУступки = УправлениеРозничнойТорговлей.ПолучитьПроцентТорговойУступки(ДоговорЭквайринга, НовыйДокумент.ВидОплаты);
		НовыйДокумент.СуммаТорговойУступки = Сумма * ПроцентТорговойУступки / 100;
		НовыйДокумент.ПроцентТорговойУступки = ПроцентТорговойУступки; 
		
	КонецЕсли;		
			
	РасшифровкаПлатежа = НовыйДокумент.РасшифровкаПлатежа.Добавить();	

	РасшифровкаПлатежа.ДоговорКонтрагента = Реализация.ДоговорКонтрагента;
	РасшифровкаПлатежа.ДокументРасчетовСКонтрагентом = Реализация; 
	РасшифровкаПлатежа.КратностьВзаиморасчетов = НовыйДокумент.КратностьДокумента;
	РасшифровкаПлатежа.КурсВзаиморасчетов = НовыйДокумент.КурсДокумента;
	
	//+Гавриленков В. 05.12.2025 #UT10-5574
	//РасшифровкаПлатежа.СтавкаНДС = Перечисления.СтавкиНДС.НДС20; 
	РасшифровкаПлатежа.СтавкаНДС = ?(НовыйДокумент.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
	//-Гавриленков В. 05.12.2025 #UT10-5574
	
	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = РасшифровкаПлатежа.ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств;
	УправлениеДенежнымиСредствами.УстановитьСтатьюДДСПоУмолчанию(РасшифровкаПлатежа, НовыйДокумент.ВидОперации);
	РасшифровкаПлатежа.СуммаВзаиморасчетов = НовыйДокумент.СуммаДокумента;
	РасшифровкаПлатежа.СуммаПлатежа = НовыйДокумент.СуммаДокумента;
	ЗначениеСтавкиНДС = УчетНДС.ПолучитьСтавкуНДС(РасшифровкаПлатежа.СтавкаНДС);
	РасшифровкаПлатежа.СуммаНДС = РасшифровкаПлатежа.СуммаПлатежа*ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
	РасшифровкаПлатежа.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
	РасшифровкаПлатежа.Проект = РасшифровкаПлатежа.ДоговорКонтрагента.ОсновнойПроект;
	РасшифровкаПлатежа.Сделка = Реализация.Сделка;
	
	Если Чеки.ИспользоватьПечатьЧековЧерезСервер() Тогда
		Чеки.ЗаполнитьСоставЧекаККМДляОПК_Возврат(НовыйДокумент);	
	КонецЕсли;
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);

	Возврат НовыйДокумент;
	
КонецФУнкции
 
Функция ПолучитьСтатусПлатежа(ОплатаПлатежнойКартой) Экспорт
	
	СтруктураРезультата = Новый Структура;	
	СтруктураРезультата.Вставить("Результат", Ложь); 
	СтруктураРезультата.Вставить("Сообщение", "");
	СтруктураРезультата.Вставить("Статус", "");
	
	СписокПараметровДляТокена = Новый СписокЗначений;
	СписокПараметровДляТокена.Добавить("Password", ОплатаПлатежнойКартой.ДоговорЭквайринга.Пароль);
	СписокПараметровДляТокена.Добавить("TerminalKey", ОплатаПлатежнойКартой.ДоговорЭквайринга.Номер);
	СписокПараметровДляТокена.Добавить("PaymentId", ОплатаПлатежнойКартой.ИДПлатежа);
	
	Токен = ПолучитьТокен(СписокПараметровДляТокена);
	
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("TerminalKey", ОплатаПлатежнойКартой.ДоговорЭквайринга.Номер);
	СтруктураЗапроса.Вставить("PaymentId", ОплатаПлатежнойКартой.ИДПлатежа);      	       
	СтруктураЗапроса.Вставить("Token", Токен);
	
	СтруктураВыполненияЗапроса = ВыполнитьPOSTЗапрос("/v2/GetState", СтруктураЗапроса);
	
	ЗаполнитьЗначенияСвойств(СтруктураРезультата, СтруктураВыполненияЗапроса);
	
	Если СтруктураРезультата.Результат Тогда
		СтруктураРезультата.Статус = СтруктураВыполненияЗапроса.Данные.Status;	
	КонецЕсли; 
	
	Возврат СтруктураРезультата;
	
КонецФункции

Функция ПолучитьТокен(СписокПараметровДляТокена)
	
	СписокПараметровДляТокена.СортироватьПоЗначению();
	
	СтрокаТокена = "";
	
	Для каждого Параметр Из СписокПараметровДляТокена Цикл
		СтрокаТокена = СтрокаТокена + Параметр.Представление;
	КонецЦикла; 
	
	Хэш = Новый ХешированиеДанных(ХешФункция.SHA256); 
	Хэш.Добавить(СтрокаТокена);
    ХешСтроки = НРег(СтрЗаменить(Строка(Хэш.ХешСумма), " ", ""));
	
	Возврат ХешСтроки;
	
КонецФункции

Функция СделатьВозвратТинькоффПоОплатеПлатежнойКартой(ОплатаПлатежнойКартой, ДокументОбъектВозврата) Экспорт
	
	СтруктураРезультата = Новый Структура;	
	СтруктураРезультата.Вставить("Результат", Ложь); 
	СтруктураРезультата.Вставить("Сообщение", "");
	СтруктураРезультата.Вставить("PaymentId", "");
	
	СуммаНаВозвратСтрока = Формат(ДокументОбъектВозврата.СуммаДокумента * 100, "ЧДЦ=0; ЧГ=0");
	СуммаНаВозвратЧисло = Число(СуммаНаВозвратСтрока);
	
	СписокПараметровДляТокена = Новый СписокЗначений;
	СписокПараметровДляТокена.Добавить("Password", ОплатаПлатежнойКартой.ДоговорЭквайринга.Пароль);
	СписокПараметровДляТокена.Добавить("TerminalKey", ОплатаПлатежнойКартой.ДоговорЭквайринга.Номер);
	СписокПараметровДляТокена.Добавить("PaymentId", ОплатаПлатежнойКартой.ИДПлатежа);
	СписокПараметровДляТокена.Добавить("Amount", СуммаНаВозвратСтрока);
	
	Токен = ПолучитьТокен(СписокПараметровДляТокена);
		
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("TerminalKey", ОплатаПлатежнойКартой.ДоговорЭквайринга.Номер);
	СтруктураЗапроса.Вставить("PaymentId", ОплатаПлатежнойКартой.ИДПлатежа);
	СтруктураЗапроса.Вставить("Token", Токен);
	СтруктураЗапроса.Вставить("Amount", СуммаНаВозвратЧисло);
	
	////Если возврат частичный, то мы должны заполнить товары, иначе возврат будет на всю сумму
	//Если ДокументОбъектВозврата.СуммаДокумента <> ОплатаПлатежнойКартой.СуммаДокумента Тогда
	//	
	//	АдресEmail = Чеки.ПолучитьEmail(ОплатаПлатежнойКартой.Контрагент);
	//	Если Не ЗначениеЗаполнено(АдресEmail) Тогда
	//		АдресEmail = Константы.РезервныйEmailДляОтправкиЭлектронныхЧеков.Получить();		
	//	КонецЕсли;    
	//	
	//	СтруктураПозицийВозврата = Новый Структура;	
	//	
	//	Если ЗначениеЗаполнено(АдресEmail)  Тогда
	//		СтруктураПозицийВозврата.Вставить("Email", АдресEmail);	
	//	КонецЕсли; 
	//	
	//	СтруктураПозицийВозврата.Вставить("Taxation", "osn");
	//			
	//	МассивПозиций = Новый Массив;
	//	
	//	Для каждого СтрПозиции Из ДокументОбъектВозврата.ПозицииЧекККМ Цикл
	//		
	//		СтруктураПозиции = Новый Структура;
	//		
	//		Если СтрПозиции.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс Тогда
	//			СтруктураПозиции.Вставить("Name", "Аванс");
	//			СтруктураПозиции.Вставить("PaymentMethod", "advance");
	//			СтруктураПозиции.Вставить("PaymentObject", "payment");
	//		Иначе
	//			СтруктураПозиции.Вставить("Name", СтрПозиции.Позиция.Наименование);
	//			СтруктураПозиции.Вставить("PaymentMethod", "full_payment");
	//			СтруктураПозиции.Вставить("PaymentObject", "commodity") ;
	//		КонецЕсли; 
	//		
	//		СтруктураПозиции.Вставить("Price", СтрПозиции.Цена);
	//		СтруктураПозиции.Вставить("Quantity", СтрПозиции.Количество);
	//		СтруктураПозиции.Вставить("Amount", СтрПозиции.Сумма);
	//		
	//		Если СтрПозиции.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
	//			СтруктураПозиции.Вставить("Tax", "none");
	//		ИначеЕсли СтрПозиции.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
	//			СтруктураПозиции.Вставить("Tax", "vat20");
	//		ИначеЕсли СтрПозиции.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда	
	//			СтруктураПозиции.Вставить("Tax", "vat120");
	//		ИначеЕсли СтрПозиции.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
	//			СтруктураПозиции.Вставить("Tax", "vat18");
	//		Иначе
	//			СтруктураПозиции.Вставить("Tax", "none");
	//		КонецЕсли;		
	//		
	//		МассивПозиций.Добавить(СтруктураПозиции);
	//		
	//	КонецЦикла; 
	//	
	//	СтруктураПозицийВозврата.Вставить("Items", МассивПозиций);
	//	
	//	
	//	СтруктураЗапроса.Вставить("Receipt", СтруктураПозицийВозврата);
	//	
	//КонецЕсли; 
	
	СтруктураВыполненияЗапроса = ВыполнитьPOSTЗапрос("/v2/Cancel", СтруктураЗапроса);
	
	ЗаполнитьЗначенияСвойств(СтруктураРезультата, СтруктураВыполненияЗапроса);
	
	Если СтруктураРезультата.Результат Тогда
		СтруктураРезультата.PaymentId = СтруктураВыполненияЗапроса.Данные.PaymentId;	
	КонецЕсли; 
	
	Возврат СтруктураРезультата;
	
КонецФункции

Функция ПроверитьОплатуПлатежнойКартойДляВозврата(ОплатаПлатежнойКартой) Экспорт
	
	СтруктураРезультата = Новый Структура;	
	СтруктураРезультата.Вставить("Результат", Ложь); 
	СтруктураРезультата.Вставить("Сообщение", "");
	
	Если Не ЗначениеЗаполнено(ОплатаПлатежнойКартой) Тогда
		
		СтруктураРезультата.Сообщение = "Не заполнен документ возврата";
		Возврат СтруктураРезультата;
		
	КонецЕсли; 
	
	Если ТипЗнч(ОплатаПлатежнойКартой) <> Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
		
		СтруктураРезультата.Сообщение = "Передан неверный тип документа возврата";
		Возврат СтруктураРезультата;
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ОплатаПлатежнойКартой.ИДПлатежа) Тогда
		
		СтруктураРезультата.Сообщение = "Не заполнен идентификатор платежа возврата";
		Возврат СтруктураРезультата;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОплатаПлатежнойКартой.НомерЧекаККМ) Тогда
		
		СтруктураРезультата.Сообщение = "Документ не пробит на кассе ККМ";
		Возврат СтруктураРезультата;
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ОплатаПлатежнойКартой.ДоговорЭквайринга.Номер) Тогда
		
		СтруктураРезультата.Сообщение = "В договоре эквайринга не заполнен реквизит Номер (номер терминала)";
		Возврат СтруктураРезультата;	
		
	КонецЕсли; 
	
	СтруктураРезультата.Результат = Истина;
	
	Возврат СтруктураРезультата;
	
КонецФункции
 
Функция ВыполнитьPOSTЗапрос(СтрокаЗапроса, СтруктураЗапроса) Экспорт	
	
	СтруктураРезультата = Новый Структура;	
	СтруктураРезультата.Вставить("Результат", Ложь); 
	СтруктураРезультата.Вставить("Сообщение", "");
	СтруктураРезультата.Вставить("Данные", "");
	
	HTTPСоединение = Новый HTTPСоединение(Константы.ТинькоффАдресБанковскогоСервера.Получить(), , , , , 10, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	
	Заголовки = Новый Соответствие;
   	Заголовки.Вставить("Content-Type", "application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки); 
	HTTPЗапрос.УстановитьТелоИзСтроки(ВернутьJSON(СтруктураЗапроса));
	
	ОтветJSONСтрока = "";                                                                                                         
	
	Попытка
				
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ОтветJSONСтрока =   Ответ.ПолучитьТелоКакСтроку();
		
		Если ЗначениеЗаполнено(СокрЛП(ОтветJSONСтрока)) Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ОтветJSONСтрока);
			СтруктураВозврата = ПрочитатьJSON(ЧтениеJSON);	
			
			Если СтруктураВозврата.Свойство("Success") Тогда
				
				Если СтруктураВозврата.Success Тогда
					
					СтруктураРезультата.Результат = Истина;	
					СтруктураРезультата.Данные = СтруктураВозврата;  
					
				Иначе
					
					Если СтруктураВозврата.Свойство("Message") Тогда						
						СтруктураРезультата.Сообщение = СтруктураВозврата.Message;						
					КонецЕсли;
					
					Если СтруктураВозврата.Свойство("Details") Тогда						
						СтруктураРезультата.Сообщение = СтруктураРезультата.Сообщение + ?(ЗначениеЗаполнено(СтруктураРезультата.Сообщение), " (", "") + СтруктураВозврата.Details + ?(ЗначениеЗаполнено(СтруктураРезультата.Сообщение), ")", "");						
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	Исключение 	
		СтруктураРезультата.Сообщение = ОписаниеОшибки();		
	КонецПопытки;
	
	Возврат СтруктураРезультата;
			
КонецФункции
	
		
///////////////////Вспомогательные процедуры///////////////////
Функция ВернутьJSON(Структура) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура,,"ОбработатьНеподдерживаемоеСвойствоJSON",Чеки);
	JsonСтрока = ЗаписьJSON.Закрыть();  	
	
	Возврат JsonСтрока;
	
КонецФункции

Функция ВернутьСтруктуруИзJSON(Строка) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	Данные = ПрочитатьJSON(ЧтениеJSON, Ложь);
	
	Возврат Данные;
	
КонецФункции

Функция ОбработатьНеподдерживаемоеСвойствоJSON(Знач Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Возврат "";
	
КонецФункции
